БухЭксп/InformationRegisters/CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриказФНС</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_РеестрыНДС0ЯчейкиПриложений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_РеестрыНДС0ЯчейкиПриложений</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНумерации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПоВидуТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПримечание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта/Ext/ManagerModule.bsl
Процедура ЗаполнитьДействующиеПриказы() Экспорт
	
	ПриказФНС = ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений;
	
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2021Кв2);
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2024Кв2);
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2025Кв2);
	ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС.РеестрНДС2025Кв2_ЕД715_1035);
	
КонецПроцедуры

Процедура ЗаполнитьРегистрСооветствияПриложенияПоПриказу(ПриказФНС) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрыНДС0ЯчейкиПриложений.ПриложениеПоВидуТранспорта КАК ВидТранспорта
	|ИЗ
	|	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	|ГДЕ
	|	CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС
	|	И CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПриказФНС", ПриказФНС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ЗаписьРегистра = РегистрыСведений.CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Период 			= ПриказФНС.ДатаНачала; 
		ЗаписьРегистра.ВидТранспорта 	= Выборка.ВидТранспорта; 
		ЗаписьРегистра.ПриказФНС 		= ПриказФНС; 
		
		ЗаписьРегистра.Прочитать();
		Если Не ЗаписьРегистра.Выбран() Тогда
			ЗаписьРегистра.Период 			= ПриказФНС.ДатаНачала; 
			ЗаписьРегистра.ВидТранспорта 	= Выборка.ВидТранспорта; 
			ЗаписьРегистра.ПриказФНС 		= ПриказФНС; 
			ЗаписьРегистра.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДействующиеПриказы(Знач НаДату=Неопределено) Экспорт   
	
	Соответствие = Новый Соответствие;
	
	Период = ?(НаДату= Неопределено, ТекущаяДата(), НаДату); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаРегистра.ВидТранспорта КАК ВидТранспорта,
	|	ТаблицаРегистра.ПриказФНС КАК ПриказФНС
	|ИЗ
	|	РегистрСведений.CW_РеестрыНДС0ДействующиеПриказыПоВидуТранспорта.СрезПоследних(&Период, ) КАК ТаблицаРегистра";
	
	Запрос.УстановитьПараметр("Период", 	Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.ВидТранспорта, Выборка.ПриказФНС);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции
